Fuentes/ficohsacore-vortex-7ebad6e8baaa/Middleware/v2/Resources/ConsultaInformacionLaboral/wsdl/consultaInformacionLaboralPS.wsdl

<wsdl:definitions name="consultaInformacionLaboralPS" targetNamespace="http://www.ficohsa.com.hn/middleware.services/consultaInformacionLaboralPS/" xmlns:fic="http://www.ficohsa.com.hn/middleware.services/consultaInformacionLaboralPS/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:con="http://www.ficohsa.com.hn/middleware.services/consultaInformacionLaboralTypes" xmlns:auth="http://www.ficohsa.com.hn/middleware.services/autType">

<wsdl:types>
	<xsd:schema>
		<xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/autType" schemaLocation="../../esquemas_generales/HeaderElements.xsd"/>
	</xsd:schema>
	<xsd:schema>    
  		<xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/consultaInformacionLaboralTypes" schemaLocation="../xsd/consultaInformacionLaboralTypes.xsd"/>
	</xsd:schema>    
</wsdl:types>    
  
<wsdl:message name="consultaInformacionLaboralPSRequest">		
	<wsdl:part name="reqHeader" element="auth:RequestHeader"/>
	<wsdl:part name="inputParameters" element="con:consultaInformacionLaboralRequest"/>
</wsdl:message>
<wsdl:message name="consultaInformacionLaboralPSResponse">		
	<wsdl:part name="rspHeader" element="auth:ResponseHeader"/>
	<wsdl:part name="outputResult" element="con:consultaInformacionLaboralResponse"/>
</wsdl:message>
  
  
  
	<wsdl:portType name="consultaInformacionLaboralPS">
		<wsdl:operation name="consultaInformacionLaboral">
			<wsdl:input message="fic:consultaInformacionLaboralPSRequest"/>
			<wsdl:output message="fic:consultaInformacionLaboralPSResponse"/>
		</wsdl:operation>
	</wsdl:portType>
		
	<wsdl:binding name="consultaInformacionLaboralPSSOAP" type="fic:consultaInformacionLaboralPS">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="consultaInformacionLaboral">
			<soap:operation soapAction="http://www.ficohsa.com.hn/middleware.services/consultaInformacionLaboralPS/consultaInformacionLaboral"/>
			<wsdl:input>				
				<soap:header use="literal" part="reqHeader" message="fic:consultaInformacionLaboralPSRequest"/>
				<soap:body use="literal" parts="inputParameters"/>
			</wsdl:input>
			<wsdl:output>				
				<soap:header use="literal" part="rspHeader" message="fic:consultaInformacionLaboralPSResponse"/>
				<soap:body use="literal" parts="outputResult"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>

  <wsdl:service name="consultaInformacionLaboralPS">
    <wsdl:port binding="fic:consultaInformacionLaboralPSSOAP" name="consultaInformacionLaboralPSSOAP">
      <soap:address location="http://10.242.104.55:8003/Middleware/ReferenceData/BusinessPartner/consultaInformacionLaboral"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>